# 🎯 OCI Terraform Plan Results (v2.0)

**Timestamp:** 2025-12-17 22:01:41  
**Orchestrator Version:** 2.0  

✅ **Status: All 1 service(s) succeeded**

## 📊 Execution Order (Dependency Levels)

**Level 1:** identity  

## 📋 Service Results

| Service | Status | Duration | Changes |
|---------|--------|----------|----------|
| identity | ✅ | 10.0s | No changes |

## 📝 Detailed Results

### ✅ identity

**Preview:**
```
data.oci_identity_availability_domains.availability_domains: Reading...
data.oci_identity_compartments.compartments: Reading...
data.oci_identity_domains.iam_domains["DEFAULT_demo-group"]: Reading...
data.oci_identity_compartments.compartments: Read complete after 0s [id=IdentityCompartmentsDataSource-1548110416]
data.oci_identity_domains.iam_domains["DEFAULT_demo-group"]: Read complete after 0s [id=IdentityDomainsDataSource-3916445316]
module.groups["DEFAULT_demo-group"].data.oci_identity_domai
... (truncated)
```

<details><summary>📄 Show Full Output (4706 chars)</summary>

```
data.oci_identity_availability_domains.availability_domains: Reading...
data.oci_identity_compartments.compartments: Reading...
data.oci_identity_domains.iam_domains["DEFAULT_demo-group"]: Reading...
data.oci_identity_compartments.compartments: Read complete after 0s [id=IdentityCompartmentsDataSource-1548110416]
data.oci_identity_domains.iam_domains["DEFAULT_demo-group"]: Read complete after 0s [id=IdentityDomainsDataSource-3916445316]
module.groups["DEFAULT_demo-group"].data.oci_identity_domains_users.users: Reading...
data.oci_identity_availability_domains.availability_domains: Read complete after 0s [id=IdentityAvailabilityDomainsDataSource-3434742406]
module.groups["DEFAULT_demo-group"].data.oci_identity_domains_users.users: Read complete after 1s [id=IdentityDomainsUsersDataSource-96710536]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.groups["DEFAULT_demo-group"].oci_identity_domains_group.group[0] will be created
  + resource "oci_identity_domains_group" "group" {
      + attribute_sets                                        = [
          + "all",
        ]
      + attributes                                            = "members"
      + compartment_ocid                                      = (known after apply)
      + delete_in_progress                                    = (known after apply)
      + display_name                                          = "demo-group"
      + domain_ocid                                           = (known after apply)
      + external_id                                           = (known after apply)
      + id                                                    = (known after apply)
      + idcs_created_by                                       = (known after apply)
      + idcs_endpoint                                         = "https://idcs-4490d3142ceb4b85ab84b43f377331a3.identity.oraclecloud.com:443"
      + idcs_last_modified_by                                 = (known after apply)
      + idcs_last_upgraded_in_release                         = (known after apply)
      + idcs_prevented_operations                             = (known after apply)
      + meta                                                  = (known after apply)
      + non_unique_display_name                               = (known after apply)
      + ocid                                                  = (known after apply)
      + schemas                                               = [
          + "urn:ietf:params:scim:schemas:core:2.0:Group",
          + "urn:ietf:params:scim:schemas:oracle:idcs:extension:OCITags",
          + "urn:ietf:params:scim:schemas:oracle:idcs:extension:group:Group",
        ]
      + tenancy_ocid                                          = (known after apply)
      + urnietfparamsscimschemasoracleidcsextensiondbcs_group = (known after apply)

      + timeouts {}

      + urnietfparamsscimschemasoracleidcsextension_oci_tags {
          + tag_slug = (known after apply)
        }

      + urnietfparamsscimschemasoracleidcsextensiongroup_group {
          + app_roles          = (known after apply)
          + creation_mechanism = (known after apply)
          + description        = "Group for CD3 test"
          + grants             = (known after apply)
          + password_policy    = (known after apply)
          + synced_from_app    = (known after apply)
        }
    }

  # module.iam-policies["Demo-Policy"].oci_identity_policy.policy will be created
  + resource "oci_identity_policy" "policy" {
      + ETag           = (known after apply)
      + compartment_id = "ocid1.tenancy.oc1..aaaaaaaa35q2p5p4e74pu5j4gg46yysktby3osjmlaxk255fkcabyhirvqoa"
      + defined_tags   = (known after apply)
      + description    = "Demo Policy - Test Trigger"
      + freeform_tags  = (known after apply)
      + id             = (known after apply)
      + inactive_state = (known after apply)
      + lastUpdateETag = (known after apply)
      + name           = "Demo-Policy"
      + policyHash     = (known after apply)
      + state          = (known after apply)
      + statements     = [
          + "allow group demo-group to read all-resources in tenancy",
        ]
      + time_created   = (known after apply)
      + version_date   = (known after apply)
    }

Plan: 2 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```
</details>

---
🤖 *Generated by OCI Terraform Orchestrator v2.0 with dependency ordering*


## 🎯 Version 2.0 Features

This plan was generated with:
- ✅ Dependency-aware execution order
- ✅ Module change detection
- ✅ Parallel execution capability
- ✅ Enhanced error recovery

## ✅ Pre-Merge Checklist

- [ ] Execution order respects dependencies
- [ ] No unexpected resource deletions
- [ ] Module changes reviewed (if any)
- [ ] Plan output matches expectations

**⚠️  Merging will trigger automatic apply**

---
🔗 [View Workflow Run](https://github.com/OCIExperimentZone/OCI_Terraform/actions/runs/20318616992)